
# Копирайте <РЕПО>/exercises/data/emp.data във вашата home директория.
cp /srv/fmi-os/exercises/data/emp.data ~/

# Посредством awk, използвайки копирания файл за входнни данни, изведете:

# - общия брой редове
awk 'END {print NR}' emp.data

# - третия ред
awk 'NR == 3 {print}' emp.data

# - последното поле от всеки ред
awk '{print $3}' emp.data

# - последното поле на последния ред
awk 'END {print $NF}' emp.data

#- всеки ред, който има повече от 4 полета
awk '{if(NF>4) print $0}' emp.data

#- всеки ред, чието последно поле е по-голямо от 4
awk '$NF>4 {print}' emp.data

# - общия брой полета във всички редове
awk '{print NF}' emp.data

# - броя редове, в които се среща низът Beth
awk 'BEGIN {i=0} {if(match($0,/Beth/)) i++} END {print i}' emp.data
#OR
awk '/Beth/' emp.data  | awk 'END {print NR}'

# - най-голямото трето поле и редът, който го съдържа
awk 'BEGIN {max=0; line=" "} {if($3>max) {max = $3;line = $0}} END {print line}' emp.data

- всеки ред, който има поне едно поле

- всеки ред, който има повече от 17 знака

- броя на полетата във всеки ред и самият ред

- първите две полета от всеки ред, с разменени места

- всеки ред така, че първите две полета да са с разменени места

- всеки ред така, че на мястото на първото поле да има номер на реда
- всеки ред без второто поле
- за всеки ред, сумата от второ и трето поле
- сумата на второ и трето поле от всеки ред
